const municipalities = [
    "আক্কেলপুর", "আগ্রাবাদ", "আশুলিয়া", "ইশ্বরদী", "ঈদগাহ", "উখিয়া", "এনায়েতপুর", "ওসমানীনগর", "কচুয়া", "কক্সবাজার", "কুমিল্লা", "কুষ্টিয়া", "কাটাখালী", "কাপাসিয়া", "কোটচাঁদপুর", "খাগড়াছড়ি", "খুলনা", "গাইবান্ধা", "গাজীপুর", "গোবিন্দগঞ্জ", "গোপালগঞ্জ", "চাঁদপুর", "চট্টগ্রাম", "চুয়াডাঙ্গা", "জয়পুরহাট", "জামালপুর", "ঝালকাঠি", "ঝিনাইদহ", "টাঙ্গাইল", "ঠাকুরগাঁও", "ঢাকা", "দিনাজপুর", "নওগাঁ", "নড়াইল", "নাটোর", "নেত্রকোণা", "নোয়াখালী", "নরসিংদী", "নারায়ণগঞ্জ", "পটুয়াখালী", "পাবনা", "পিরোজপুর", "ফরিদপুর", "ফেনী", "বগুড়া", "বরগুনা", "বরিশাল", "ভোলা", "মাগুরা", "মাদারীপুর", "মানিকগঞ্জ", "মেহেরপুর", "মৌলভীবাজার", "ময়মনসিংহ", "যশোর", "রাজবাড়ী", "রাজশাহী", "রংপুর", "লক্ষ্মীপুর", "লালমনিরহাট", "শরীয়তপুর", "শেরপুর", "সাতক্ষীরা", "সিরাজগঞ্জ", "সিলেট", "সুনামগঞ্জ", "হবিগঞ্জ"
];

const divisions = [
    "ঢাকা", "চট্টগ্রাম", "খুলনা", "রাজশাহী", "বরিশাল", "সিলেট", "রংপুর", "ময়মনসিংহ"
];

const districts = [
    "কক্সবাজার", "কুমিল্লা", "খাগড়াছড়ি", "খুলনা", "গাইবান্ধা", "গাজীপুর", "গোপালগঞ্জ", "চাঁদপুর", "চট্টগ্রাম", "চুয়াডাঙ্গা", "জয়পুরহাট", "জামালপুর", "ঝালকাঠি", "ঝিনাইদহ", "টাঙ্গাইল", "ঠাকুরগাঁও", "ঢাকা", "দিনাজপুর", "নওগাঁ", "নড়াইল", "নাটোর", "নেত্রকোণা", "নোয়াখালী", "নরসিংদী", "নারায়ণগঞ্জ", "পটুয়াখালী", "পাবনা", "পিরোজপুর", "ফরিদপুর", "ফেনী", "বগুড়া", "বরগুনা", "বরিশাল", "ভোলা", "মাগুরা", "মাদারীপুর", "মানিকগঞ্জ", "মেহেরপুর", "মৌলভীবাজার", "ময়মনসিংহ", "যশোর", "রাজবাড়ী", "রাজশাহী", "রংপুর", "লক্ষ্মীপুর", "লালমনিরহাট", "শরীয়তপুর", "শেরপুর", "সাতক্ষীরা", "সিরাজগঞ্জ", "সিলেট", "সুনামগঞ্জ", "হবিগঞ্জ"
];

const postOffices = [
    "ঢাকা", "সিলেট", "চট্টগ্রাম", "খুলনা", "রাজশাহী", "বরিশাল", "রংপুর", "ময়মনসিংহ"
];

const sadars = [
    "ঢাকা", "চট্টগ্রাম", "খুলনা", "রাজশাহী", "সিলেট", "বরিশাল", "রংপুর", "ময়মনসিংহ"
];

const citys = [
    "ঢাকা উত্তর সিটি কর্পোরেশন",
    "ঢাকা দক্ষিণ সিটি কর্পোরেশন",
    "চট্টগ্রাম সিটি কর্পোরেশন",
    "খুলনা সিটি কর্পোরেশন",
    "রাজশাহী সিটি কর্পোরেশন",
    "বরিশাল সিটি কর্পোরেশন",
    "সিলেট সিটি কর্পোরেশন",
    "রংপুর সিটি কর্পোরেশন",
    "গাজীপুর সিটি কর্পোরেশন",
    "নারায়ণগঞ্জ সিটি কর্পোরেশন",
    "কুমিল্লা সিটি কর্পোরেশন",
    "ময়মনসিংহ সিটি কর্পোরেশন"
];


function populateOptions(selectId, optionsArray) {
    const selectElement = document.getElementById(selectId);
    selectElement.innerHTML = '<option value="">নির্বাচন করুন</option>';
    optionsArray.sort();
    optionsArray.forEach(optionText => {
        const option = document.createElement("option");
        option.value = optionText;
        option.textContent = optionText;
        selectElement.appendChild(option);
    });
}

document.addEventListener("DOMContentLoaded", () => {
    populateOptions("pourosoba", municipalities);
    populateOptions("division", divisions);
    populateOptions("zila", districts);
    populateOptions("post_office", postOffices);
    populateOptions("sadar", sadars);
    populateOptions("city", citys);
});
